{"pageProps":{"post":{"attributes":{"description":""},"html":"<p>Have you heard of <a href=\"https://frontendmasters.com/courses/mongodb/\">MongoDB</a>? Scott Moss has a great course on it on Frontend Masters. It&#39;s a document-oriented database (as opposed to a relational database like PostgreSQL.) It really excels at data that is <em>unstructured</em>. Unstructured data means it&#39;s really hard to say ahead of time what your data is going to look like. It can be things like &quot;I don&#39;t know how my data schema is going to evolve&quot; to &quot;I don&#39;t know how many things is going to have.&quot;</p>\n<p>Take our photos table for example. We don&#39;t know how many photos each recipe is going to have. They each could have 0 photos or 30 photos. Both of those are acceptable and correct. MongoDB used to be the only* (yes, others did it, but MongoDB was the most used) way to handle that well.</p>\n<p>Then Postgres introduced the JSON (and then subsequently the JSONB) data type that allows PostgreSQL to handle these unbounded schemas, similar to how MongoDB does. Essentially the JSONB datatype lets you stick a JSON object into a column and then later we can use specific language to query that object.</p>\n<h2 id=\"hstore\">hstore</h2>\n<p>A little note on hstore, a data type that we won&#39;t be covering today. It&#39;s a key value store (think memcache or Redis) data type for PostgreSQL. These days it&#39;s far less useful because you can get basically all the functionality from JSONB.</p>\n<h2 id=\"json-vs-jsonb\">JSON vs JSONB</h2>\n<p>For almost everything we&#39;re going to show here you could use either. If you want a one liner: always use JSONB, in almost every case it&#39;s better. The JSON datatype is a text field that validates it&#39;s valid JSON, and that&#39;s it. It doesn&#39;t do any compression, doesn&#39;t validate any of the interior values datatypes, and a few other benefits. The B in JSONB literally stands for &quot;better&quot;.</p>\n<p><a href=\"https://www.citusdata.com/blog/2016/07/14/choosing-nosql-hstore-json-jsonb/\">Here&#39;s a great blog post on it from Citus Data</a>. Heres&#39;s a quote on what they recommend:</p>\n<blockquote>\n<ul>\n<li>JSONB - In most cases</li>\n<li>JSON - If you’re just processing logs, don’t often need to query, and use as more of an audit trail</li>\n<li>hstore - Can work fine for text based key-value looks, but in general JSONB can still work great here</li>\n</ul>\n</blockquote>\n","slug":"unstructured-data","title":"Unstructured Data","section":"JSONB","icon":"code","filePath":"/home/runner/work/complete-intro-to-sql/complete-intro-to-sql/lessons/05-jsonb/A-unstructured-data.md","nextSlug":"/lessons/jsonb/jsonb","prevSlug":"/lessons/joins-and-constraints/project"}},"__N_SSG":true}