{"pageProps":{"post":{"attributes":{"title":"Node.js and PostgreSQL"},"html":"<p>This is not a Node.js class so the expectation of your Node.js skills here are fairly low. No worries if you don&#39;t have a ton of experience with Node.js</p>\n<p>We are going to be using the <a href=\"https://node-postgres.com/\">pg</a> package which is <a href=\"https://npmtrends.com/knex-vs-objection-vs-pg-vs-sequelize-vs-typeorm\">the most common PostgreSQL client</a> for Node.js. There are others but this is the one with the most direct access to the underlying queries which is what we want. Feel free to use an ORM in your projects but it&#39;s useful to know how the underlying PostgreSQL works.</p>\n<p>Before I dump you into the code I wanted to give you a very brief tour of what to expect.</p>\n<h2 id=\"connecting-to-a-database\">Connecting to a database</h2>\n<p>pg has two ways to connect to a database: a client and a pool.</p>\n<p>You can think of a client as an individual connection you open and then eventually close to your PostgreSQL database. When you call <code>connect</code> on a client, it handshakes with the server and opens a connection for you to start using. You eventually call <code>end</code> to end your session with a client.</p>\n<p>A pool is a pool of clients. Opening and closing clients can be expensive if you&#39;re doing it a lot. Imagine you have a server that gets 1,000 requests per second and every one of those needs to open a line to a database. All that opening and closing of connections is a lot of overhead. A pool therefore holds onto connections. You basically just say &quot;hey pool, query this&quot; and if it has a spare connection open it will give it to you. If you don&#39;t then it will open another one. Pretty neat, right?</p>\n<p>Okay, we&#39;re going to be using pools today since we&#39;re doing a web server. I&#39;d really only use a client for a one-off script or if I&#39;m doing transactions which aren&#39;t supported by pools (transactions are not covered in this course but it&#39;s if multiple queries <em>have</em> to happen all at once or not all). Otherwise I&#39;d stick to pools. One isn&#39;t any harder to use than the other.</p>\n<p>So let&#39;s see how to connect to a database.</p>\n<pre><code class=\"language-javascript\">const pg = require(&quot;pg&quot;);\nconst pool = new pg.Pool({\n  user: &quot;postgres&quot;,\n  host: &quot;localhost&quot;,\n  database: &quot;recipeguru&quot;,\n  password: &quot;lol&quot;,\n  port: 5432,\n});\n</code></pre>\n<ul>\n<li>These are the default credentials combined with what I set up in the previous lessons. Make sure you&#39;re using the correct credentials.</li>\n<li>Make sure you started PostgreSQL via docker with the <code>-p 5432:5432</code> flag or PostgreSQL won&#39;t be exposed on your host system.</li>\n<li>Make sure your database is running too.</li>\n</ul>\n<p>Once you&#39;ve done this, you can now start making queries to PostgreSQL!</p>\n<p>Let&#39;s write a query.</p>\n<pre><code class=\"language-javascript\">const { rows } = await pool.query(`SELECT * FROM recipes`);\n</code></pre>\n<ul>\n<li><code>rows</code> will be the response of the query.</li>\n<li>There&#39;s lot of other metadata on these queries beyond just the rows. Feel free to <code>console.log</code> it or <code>debug</code> it to explore.</li>\n<li>pg will add the <code>;</code> at the end for you.</li>\n</ul>\n<h2 id=\"parameterization-and-sql-injection\">Parameterization and SQL injection</h2>\n<p>Let&#39;s say you wanted to query for one specific ingredient by <code>id</code> and that id was passed in via an AJAX request.</p>\n<pre><code class=\"language-sql\">SELECT * FROM ingredients WHERE id = &lt;user input here&gt;;\n</code></pre>\n<p>What&#39;s wrong with then doing then:</p>\n<pre><code class=\"language-javascript\">const { id } = req.query;\nconst { rows } = await pool.query(`SELECT * FROM ingredients WHERE id=${id}`);\n</code></pre>\n<p>SQL injection. You&#39;re just raw passing in user data to a query and a user could fathomably put <em>anything</em> in that id API request. What happens if a user made id equal to <code>1; DROP TABLE users; --</code>?</p>\n<blockquote>\n<p>Do not run the next query. Well, it wouldn&#39;t matter since we don&#39;t have a users table but still, it&#39;s meant to be a demonstration of what could happen.</p>\n</blockquote>\n<pre><code class=\"language-sql\">SELECT * FROM ingredients WHERE id=1; DROP TABLE users; --\n</code></pre>\n<p>Oh no 😱</p>\n<p>The first <code>1;</code> ends the first query. The <code>DROP TABLE users;</code> does whatever malicious thing the hacker wants to do. They can delete info like this one does, or they can dump info that you don&#39;t want them to. The <code>--</code> says &quot;everything after this is a comment&quot; so it comments out the rest of your SQL if anything came after it.</p>\n<p>This is SQL injection and a very real issue with SQL in apps. It&#39;s why Wordpress apps are always under attack because they use MySQL behind the scenes. If you can find somewhere you can inject SQL you can get a lot of info out of an app.</p>\n<p>So how do we avoid it? Sanitization of your inputs and parameterization of your queries.</p>\n<pre><code class=\"language-javascript\">const { id } = req.query;\n\nconst { rows } = await pool.query(`SELECT * FROM ingredients WHERE id=$1`, [\n  id,\n]);\n</code></pre>\n<p>If you do this, pg will handle making sure that what goes into the query is safe to send to your database. Easy enough, right?</p>\n<blockquote>\n<p>If you need to do a a thing like <code>WHERE text ILIKE &#39;%star wars%&#39;</code> and you&#39;re using parameterized queryies, just put the <code>%</code> in the thing to be inserted, e.g. <code>(&#39;WHERE text ILIKE $1&#39;, [&#39;%star wars%&#39;])</code></p>\n</blockquote>\n","slug":"nodejs-and-postgresql","title":"Node.js and PostgreSQL","section":"Data","icon":"table","filePath":"/home/runner/work/complete-intro-to-sql/complete-intro-to-sql/lessons/03-data/E-nodejs-and-postgresql.md","nextSlug":"/lessons/data/project","prevSlug":"/lessons/data/like-and-functions"}},"__N_SSG":true}