{"pageProps":{"post":{"attributes":{"description":""},"html":"<p>You actually already know what constraints are and have used them not once but TWICE so far!</p>\n<p>A constraint is just a constraint you put around a column. For example, NOT NULL is a constraint we&#39;ve used for our primary keys. You always need a primary key.</p>\n<p>UNIQUE is another constraint that dictates that this column must be unique amongst all other columns. Ever wonder how an app can tell you so quickly if an email or a user name is taken so quickly? They likely use a UNIQUE constraint on those two columns. They should. PRIMARY is another such constraint.</p>\n<p>We also added a constraint on recipe_ingredients that every row must have a unique combination of recipe_id and ingredient_id. We could have added an additional primary, incrementing, unique ID but what would we use that for? To me at this moment it doesn&#39;t serve a purpose so we can just use the other two as a unique key. This is common for these sorts of many-to-many connecting tables.</p>\n<p>Foreign keys are a type of constraint as well. They enforce consistency amongst tables.</p>\n<h2 id=\"check\">CHECK</h2>\n<p>CHECK allows you to set conditions on the data. You can use it for enforcing enumerated types (e.g. &#39;male&#39;, &#39;female&#39;, &#39;nonbinary&#39;, &#39;other&#39; for gender.) Or you could have it test that a zipcode is five characters (in the USA.) Or that an age isn&#39;t a negative number.</p>\n<p>We actually have a very good use case for one: our type in the ingredients. It can be &#39;fruit&#39;, &#39;vegetable&#39;, &#39;meat&#39;, or &#39;other&#39;. We could write a CHECK constraint that enforces that.</p>\n<pre><code class=\"language-sql\">ALTER TABLE ingredients\nADD CONSTRAINT type_enums\nCHECK\n  (type IN (&#39;meat&#39;,&#39;fruit&#39;,&#39;vegetable&#39;,&#39;other&#39;));\n</code></pre>\n<p>This will add a constraint to the existing table. You can also create these constraints when you create the table (like we did with the foreign keys as well as unique, not null, and primary.)</p>\n<p>Just for fun, let&#39;s try to break it.</p>\n<pre><code class=\"language-sql\">INSERT INTO\n  ingredients\n  (title, image, type)\nVALUES\n  (&#39;lol&#39;, &#39;wat.svg&#39;, &#39;obviously not a type&#39;);\n</code></pre>\n","slug":"constraints","title":"Constraints","section":"Joins and Constraints","icon":"code-merge","filePath":"/home/runner/work/complete-intro-to-sql/complete-intro-to-sql/lessons/04-joins-and-constraints/E-constraints.md","nextSlug":"/lessons/joins-and-constraints/project","prevSlug":"/lessons/joins-and-constraints/many-to-many"}},"__N_SSG":true}