{"pageProps":{"post":{"attributes":{},"html":"<p>Notice in our query above that &quot;xiao long bao&quot; does not show up at all. Makes sense, we have no photos of xiao long bao so why would they show up? INNER JOIN was the correct choice for what semantics we intended.</p>\n<p>Okay, but let&#39;s say we were populating a list of all our recipes and their photos and we had a default image if a recipe didn&#39;t have any photos? Then INNER JOIN doesn&#39;t make sense because INNER JOIN only gives up things where they exist in both table A and table B. So how would we accomplish this task then?</p>\n<pre><code class=\"language-sql\">SELECT r.title, r.body, rp.url\n  FROM recipes_photos rp\n  RIGHT OUTER JOIN\n    recipes r\n  ON\n    rp.recipe_id = r.recipe_id;\n</code></pre>\n<p>Or just</p>\n<pre><code class=\"language-sql\">SELECT r.title, r.body, rp.url\n  FROM recipes_photos rp\n  RIGHT JOIN\n    recipes r\n  ON\n    rp.recipe_id = r.recipe_id;\n</code></pre>\n<p>(The OUTER is optional.)</p>\n<p>So what is this? This is saying &quot;join everything has a match (aka everything in INNER JOIN) as a row. Leave out everything in the table in the <code>FROM</code> clause that doesn&#39;t have a match (which in this case would mean leave out any photos that aren&#39;t matched to a recipe. We don&#39;t have any anyway and shouldn&#39;t. Orphan photos would just be bloat.)</p>\n<p>The <code>RIGHT</code> part of this means &quot;include all recipes without photos&quot;. That&#39;s what the RIGHT part means. If you wanted any photos included that didn&#39;t have recipes, you guessed it, you&#39;d use <code>LEFT</code>.</p>\n<p>What if we want both?</p>\n<pre><code class=\"language-sql\">SELECT r.title, r.body, rp.url\n  FROM recipes_photos rp\n  FULL OUTER JOIN\n    recipes r\n  ON\n    rp.recipe_id = r.recipe_id;\n</code></pre>\n<p>This is a combination of LEFT and RIGHT join, pluse the INNER.</p>\n<p><a href=\"https://commons.wikimedia.org/wiki/File:SQL_Joins.svg\"><img src=\"../images/SQL_Joins.png\" alt=\"diagram of SQL joins\"></a></p>\n<p>As you can see here in this diagram, you can select for any overlap of the two Venn diagrams. They&#39;re all &quot;correct&quot;; it just depends what you mean to select. There&#39;s no one correct way. That&#39;s like asking &quot;is + or - correct?&quot; Well, it depends on what you&#39;re trying to do!</p>\n<h2 id=\"natural-join\">NATURAL JOIN</h2>\n<p>I intentionally named <code>recipe_id</code> in both tables the same to show you this fun party trick.</p>\n<pre><code class=\"language-sql\">SELECT *\n  FROM recipes_photos\n  NATURAL JOIN\n    recipes;\n</code></pre>\n<p>What is this sorcery!? Because we named recipe_id the same in both, Postgres is smart enough to put two and two together and figure out that that&#39;s what we should join on.</p>\n<p><code>NATURAL JOIN</code> is short for <code>NATURAL INNER JOIN</code>. <code>NATURAL LEFT JOIN</code> and <code>NATURAL RIGHT JOIN</code> are also possible too.</p>\n<p>In general let me steer you away from this in your code. Your tables can change down the line and you could accidentally name things the same that aren&#39;t the same (like <code>id</code> being a classic one.) It&#39;s useful for quick querying like we&#39;re doing, but I&#39;d say be explicit and avoid NATURAL&#39;s implicit behavior. Still cool though, right?</p>\n<h2 id=\"cross-join\">CROSS JOIN</h2>\n<p>A small note on a not super useful type of JOIN. Let&#39;s say you had two tables. In table 1 you had colors: green, blue, and red. In table 2 you have animals: dog, cat, and chicken. You want to make every possible permutation of the combination of both tables: green dog, green cat, green chicken, blue dog, blue cat, etc. There&#39;s an ability to do this with CROSS JOIN</p>\n<pre><code class=\"language-sql\">SELECT r.title, r.body, rp.url\n  FROM recipes_photos rp\n  CROSS JOIN\n    recipes r;\n</code></pre>\n<p>Keep in mind that 3 rows in each table yielded 9 rows. In our case, it yield 78 rows! It&#39;s not typically the most useful kind of join but good to know it&#39;s there.</p>\n","slug":"other-types-of-joins","title":"Other Types of Joins","section":"Joins and Constraints","icon":"code-merge","filePath":"/home/runner/work/complete-intro-to-sql/complete-intro-to-sql/lessons/04-joins-and-constraints/B-other-types-of-joins.md","nextSlug":"/lessons/joins-and-constraints/foreign-keys","prevSlug":"/lessons/joins-and-constraints/relationships"}},"__N_SSG":true}