{"pageProps":{"post":{"attributes":{},"html":"<p>Let&#39;s create our first table, the <code>ingredients</code> table.</p>\n<pre><code class=\"language-sql\">CREATE TABLE ingredients (\n  id INTEGER PRIMARY KEY GENERATED ALWAYS AS IDENTITY,\n  title VARCHAR ( 255 ) UNIQUE NOT NULL\n);\n</code></pre>\n<blockquote>\n<p>INT, INT4 or INTEGER are the same thing. Feel free to use what suits you. Similarly DEC, FIXED, and DECIMAL are the same thing.</p>\n</blockquote>\n<p>This will create our first table for us to start using. We will get into data types during the course but just know now that a VARCHAR is a string of max length 255 characters and an INTEGER is, well, an integer.</p>\n<p>To see the table you created, run <code>\\d</code> in your psql instance to see it and the the sequence that you created. The sequence stores the <code>id</code> counter.</p>\n<p>We now have a table. A table is the actual repository of data. Think of a database like a folder and a table like a spreadsheet. You can have many spreadsheets in a folder. Same with tables.</p>\n<p>We now have a table, ingredients. Our table has two fields in it, an incrementing ID and a string that is the the title of the ingredients. You can think of fields like columns in a spreadsheet.</p>\n<p>A table contains records. A record can be thought of as a row in a spreadsheet. Every time we insert a new record into a table, we&#39;re adding another row to our spreadsheet.</p>\n<blockquote>\n<p>The spreadsheet analogy isn&#39;t just theoretical. <a href=\"https://www.npmjs.com/package/google-spreadsheet\">You can essentially use Google Sheets as a database</a> (appropriate for small, infrequent use.)</p>\n</blockquote>\n<p>Let&#39;s add a record to our table.</p>\n<pre><code class=\"language-sql\">INSERT INTO ingredients (title) VALUES (&#39;bell pepper&#39;);\n</code></pre>\n<blockquote>\n<p>We&#39;ll get more into these queries in a sec. For now just roll with it.</p>\n</blockquote>\n<p>This adds one row with a title of bell pepper. Where is the id? Since we made it <code>GENERATED ALWAYS AS IDENTITY</code> it gets created automatically. Since this is the first item in our database, its ID will be <code>1</code>. As you have likely guessed already, the next item in the table will be <code>2</code>.</p>\n<blockquote>\n<p>Previously PostgreSQL used a field type called SERIAL to describe the serially incrementing IDs. The GENERATED AS ALWAYS syntax is newer, more compliant to the generic SQL spec, and works better. Always use it over SERIAL.</p>\n</blockquote>\n<p>Let&#39;s see the record.</p>\n<pre><code class=\"language-sql\">SELECT * FROM ingredients;\n</code></pre>\n<blockquote>\n<p>We&#39;ll dive into SELECTs in a bit.</p>\n</blockquote>\n<p>You should see something like</p>\n<pre><code class=\"language-plaintext\"> id |    title\n----+-------------\n  1 | bell pepper\n</code></pre>\n<p>Amazing! We now have a table with a record in it.</p>\n<h2 id=\"dropping-a-table\">Dropping a table</h2>\n<p>What if we messed up and we didn&#39;t want an ingredients table?</p>\n<pre><code class=\"language-sql\">DROP TABLE ingredients;\n</code></pre>\n<p>Pretty simple, right? That&#39;s it! Do be careful with this command. Like <code>rm</code> in bash, it&#39;s not one you can recover from. Once a table is dropped, it is dropped.</p>\n<h2 id=\"alter-table\">ALTER TABLE</h2>\n<p>Let&#39;s recreate our table.</p>\n<pre><code class=\"language-sql\">CREATE TABLE ingredients (\n  id INTEGER PRIMARY KEY GENERATED ALWAYS AS IDENTITY,\n  title VARCHAR ( 255 ) UNIQUE NOT NULL\n);\n</code></pre>\n<p>Okay so now we have a table again. What happens if we wanted to add a third field to our table? Let&#39;s add an <code>image</code> field that will point to a URL of an image of the item.</p>\n<pre><code class=\"language-sql\">ALTER TABLE ingredients ADD COLUMN image VARCHAR ( 255 );\n</code></pre>\n<p>Likewise we can drop it too:</p>\n<pre><code class=\"language-sql\">ALTER TABLE ingredients DROP COLUMN image;\n</code></pre>\n<p>There&#39;s a lot of ways to alter a table. You can make it UNIQUE like we did or NOT NULL. You can also change the data type. For now let&#39;s add back our extra column.</p>\n<pre><code class=\"language-sql\">ALTER TABLE ingredients\nADD COLUMN image VARCHAR ( 255 ),\nADD COLUMN type VARCHAR ( 50 ) NOT NULL DEFAULT &#39;vegetable&#39;;\n</code></pre>\n<p>This is how you add multiple records! Just add multiple &quot;ADD COLUMN&quot;s. As you may have guessed, you can do multiple different types of operations if you need to in one atomic transaction.</p>\n<blockquote>\n<p>Specifying a DEFAULT when using a NOT NULL constraint will prevent errors if the column has existing null values.</p>\n</blockquote>\n<h2 id=\"data-types\">Data types</h2>\n<p>There are so many data types in PostgreSQL that we won&#39;t get close to covering them all. <a href=\"https://www.postgresql.org/docs/current/datatype.html\">Have a peek here from the PostgreSQL docs</a></p>\n","slug":"tables","title":"Tables","section":"Databases and Tables","icon":"database","filePath":"/home/runner/work/complete-intro-to-sql/complete-intro-to-sql/lessons/02-databases-and-tables/B-tables.md","nextSlug":"/lessons/data/inserts","prevSlug":"/lessons/databases-and-tables/databases"}},"__N_SSG":true}