{"pageProps":{"post":{"attributes":{"description":""},"html":"<p>A different-but-similar idea to functions is procedures. They&#39;re really similar and have a lot of overlap but have some slight differences.</p>\n<p>Functions can do more. Almost everything that procedures can do functions can also do whereas vice versa is not true.</p>\n<p>A procedure is designed to do an action of some variety. It&#39;s explictly <em>not</em> for returning data (and cannot return data) whereas a function can return data (but does not have to.)</p>\n<p>Let&#39;s make an example with our recipes database. Let&#39;s say we have some churn on our ingredients where images can get created and deleted and sometimes images are set to null. Let&#39;s say we wanted to <em>tolerate</em> that (as in we don&#39;t want to make it so there&#39;s a constraint on the image column on NOT NULL) but we periodically want to go update that column to be default.jpg if there&#39;s nothing set. First, let&#39;s select everything has null for an image.</p>\n<pre><code class=\"language-sql\">SELECT * FROM ingredients WHERE image IS NULL;\n</code></pre>\n<p>Nothing right now (if you&#39;ve been following along with me.) So let&#39;s insert another real quick.</p>\n<pre><code class=\"language-sql\">INSERT INTO\n  ingredients\n  (title, type)\nVALUES\n  (&#39;venison&#39;, &#39;meat&#39;);\n</code></pre>\n<p>Okay, let&#39;s try our query again.</p>\n<pre><code class=\"language-sql\">SELECT * FROM ingredients WHERE image IS NULL;\n</code></pre>\n<p>We could write an update that we run via cron job that just called <code>UPDATE</code> but let&#39;s write a procedure that does it.</p>\n<pre><code class=\"language-sql\">CREATE PROCEDURE\n  set_null_ingredient_images_to_default()\nLANGUAGE\n  SQL\nAS\n$$\n  UPDATE\n    ingredients\n  SET\n    image = &#39;default.jpg&#39;\n  WHERE\n    image IS NULL;\n$$;\n</code></pre>\n<ul>\n<li>Notice we did not use the <code>plpgsql</code> language but the <code>SQL</code> language. Because this is a simple query without any other bells or whistles, we can use straight SQL as the language. If we needed conditionals, loops, or any other programming &quot;stuff&quot; we&#39;d need something like plpgsql, JavaScript, Python, etc.</li>\n<li>Other than that, this looks a lot like a function with no return type. It does its action and it is done.</li>\n</ul>\n<p>Okay, let&#39;s invoke this procedure now.</p>\n<pre><code class=\"language-sql\">CALL set_null_ingredient_images_to_default();\nSELECT * FROM ingredients WHERE image IS NULL;\n</code></pre>\n<p>You use <code>CALL</code> instead of SELECT to invoke procedures. Now we can invoke this procedure whenever we need to periodically make some maintenance to our images.</p>\n<p>We&#39;ll expand on a great way to use procedures in the next lesson with triggers.</p>\n","slug":"procedures","title":"Procedures","section":"Functions Triggers and Procedures","icon":"stairs","filePath":"/home/runner/work/complete-intro-to-sql/complete-intro-to-sql/lessons/07-functions-triggers-and-procedures/B-procedures.md","nextSlug":"/lessons/functions-triggers-and-procedures/triggers","prevSlug":"/lessons/functions-triggers-and-procedures/functions"}},"__N_SSG":true}