{"pageProps":{"post":{"attributes":{},"html":"<p>You did it!</p>\n<p>Congratulations, you are well on your way to being an expert at SQL and PostgreSQL. Some final thoughts for you on what you learned today.</p>\n<ul>\n<li><em>Most</em> of what you learned today is applicable to _any SQL database: MySQL, Oracle, SQLite, Microsoft SQL Server, etc. SQL is a general spec that all of these database then take and put their own flavor on. Many of these queries will work as-is on a different database. The rest have to be tweaked slightly to fit the other database&#39;s flavor. But all the principles you learned apply.</li>\n<li>This course focused exclusively on how to query a database and was generally focused from a programmer&#39;s perspective and <em>not</em> an operations perspective. Notice we didn&#39;t talk about replication, configuring a server, deploying, backing up, replication, etc. This is a course for another time (and another teacher!) This was to teach you about basic querying skills.</li>\n<li>We also didn&#39;t cover ORMs for Node.js. In general I&#39;ve had more problems then time saved with using ORMs. I always want to have access to the underlying SQL at the end of the day. I normally need that control.</li>\n</ul>\n<p>We also did not talk a lot about execution order of queries whereas lots of other courses do talk about it. Why? When I learned SQL for the first time I found it <em>very</em> confusing and I focused a lot on it when in reality 90% of the time it doesn&#39;t actually matter. Do you care if a <code>INNER JOIN</code> or a <code>WHERE</code> happens first? Normally no! Hence I left it out and as an exercise to you to explore more if you want to delve into it. Suffice to say, queries break down into a plan from PostgreSQL and then are executed in a particular order. In general you don&#39;t have to care. Only time we cared is with <code>WHERE</code> vs <code>HAVING</code> where HAVING has to happen last. [See this blog post][post] to have a more comprehensive overview.</p>\n<p>Great job again! I hope you enjoyed the course! Please <a href=\"https://twitter.com/hotlbt\">tweet at me</a> what you thought and <a href=\"https://github.com/btholt/complete-intro-to-sql\">give this repo a star</a>!</p>\n","slug":"congrats","title":"Congrats","section":"Conclusion","icon":"face-smile-beam","filePath":"/home/runner/work/complete-intro-to-sql/complete-intro-to-sql/lessons/15-conclusion/A-congrats.md","nextSlug":"/lessons/conclusion/project","prevSlug":"/lessons/self-join/self-join"}},"__N_SSG":true}