{"pageProps":{"post":{"attributes":{"title":"Introduction","description":"Brian welcomes you to the course and sets expectations of what you will learn in the Complete Intro to SQL and PostgreSQL"},"html":"<p>Hello! And welcome to the Complete Intro to SQL and PostgreSQL as taught by <a href=\"https://twitter.com/holtbt\">Brian Holt</a>.</p>\n<p><img src=\"./images/course-icon.png\" alt=\"course logo\"></p>\n<p>I wrote this course to help developers get more acquainted with what can be an intimidating topic: SQL. SQL, like coding in general, has a great amount of depth to it which can make it seem unapproachable to people who haven&#39;t spent much time with it. I can tell you as a veteran developer with lots of experience with SQL that while there is much depth to be had, there is a lot you can get done with an introductory set of knowledge. A cursory knowledge of SQL yields most of the benefit in my opinion and the depth only makes it better.</p>\n<p>In this course you will learn</p>\n<ul>\n<li>How to set up your first database and tables</li>\n<li>How to think about data going into your tables</li>\n<li>The best ways to query your data for your application</li>\n<li>How to identify and optimize slow queries</li>\n<li>How to connect your SQL queries to Node.js</li>\n</ul>\n<p>It does bear talking about that we are <em>not</em> going to be talking about managing and operating database e.g. how to deploy it, how to containerize it, how to replicate and shard data, etc. This is a developer intro and solely focused on the developer&#39;s perspective.</p>\n<h2 id=\"who-is-this-course-for--prerequisites\">Who is this course for / Prerequisites</h2>\n<p>You, hopefully!</p>\n<p>The course is designed for developers who want to know better how to use SQL and PostgreSQL. Here&#39;s what I&#39;d suggest you know before starting this course:</p>\n<ul>\n<li><a href=\"https://internetfundamentals.com/\">Internet Fundamentals</a> – This is essential. You should have the fundamentals of using a computer and the Internet down.</li>\n<li><a href=\"https://frontendmasters.com/courses/web-development-v3/\">Basic coding abilities, preferably JavaScript</a> – A little coding experience at the very least will help a lot with the logical reasoning in this class.</li>\n<li><a href=\"https://frontendmasters.com/courses/node-js-v2/\">A little Node.js</a> – Less essential but will help a lot with the exercises. Outside of the two exercises there are no Node.js sections.</li>\n</ul>\n<h2 id=\"set-up\">Set up</h2>\n<p>This course works and has been tested on both macOS and Windows 10/11. It also will work very well on Linux (just follow the macOS instructions). You shouldn&#39;t need a particularly powerful computer for any part of this course. 8GB of RAM would more than get you through it and you can likely get away with less.</p>\n<ul>\n<li>You will need to install Docker. Instructions are in the next lesson.</li>\n<li>While you do not have to use <a href=\"https://code.visualstudio.com/\">Visual Studio Code</a>, it is what I will be using and I&#39;ll be giving you fun tips for it along the way. I was on the VS Code team so I&#39;m a bit biased!</li>\n<li>People often ask me what my coding set up is so let&#39;s go over that really quick!<ul>\n<li>Font: <a href=\"https://www.monolisa.dev/\">MonoLisa</a>. Be sure to <a href=\"https://worldofzero.com/posts/enable-font-ligatures-vscode/\">enable ligatures</a> in VS Code! If you want ligatures without Dank, check out Microsoft&#39;s <a href=\"https://github.com/microsoft/cascadia-code\">Cascadia Code</a>.</li>\n<li>Theme: I actually just like Dark+, the default VS Code theme. Though I do love <a href=\"https://marketplace.visualstudio.com/items?itemName=sdras.night-owl\">Sarah Drasner&#39;s Night Owl</a> too.</li>\n<li>Terminal: I just switched back to using macOS&#39;s built in terminal. <a href=\"https://iterm2.com/\">iTerm2</a> is great too. On Windows I love <a href=\"https://www.microsoft.com/en-us/p/windows-terminal/9n0dx20hk701?activetab=pivot:overviewtab\">Windows Terminal</a>.</li>\n<li>VS Code Icons: the <a href=\"https://marketplace.visualstudio.com/items?itemName=vscode-icons-team.vscode-icons\">vscode-icons</a> extension.</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"where-to-file-issues\">Where to File Issues</h2>\n<p>I write these courses and take care to not make mistakes. However when teaching many hours of material, mistakes are inevitable, both here in the grammar and in the course with the material. However I (and the wonderful team at Frontend Masters) are constantly correcting the mistakes so that those of you that come later get the best product possible. If you find a mistake we&#39;d love to fix it. The best way to do this is to <a href=\"https://github.com/btholt/complete-intro-to-sql/issues\">open a pull request or file an issue on the GitHub repo</a>. While I&#39;m always happy to chat and give advice on social media, I can&#39;t be tech support for everyone. And if you file it on GitHub, those who come later can Google the same answer you got.</p>\n<h2 id=\"who-am-i\">Who am I</h2>\n<p>My name is Brian Holt and I am a product manager at Stripe. I work on all sorts of developer tools like the Stripe VS Code extension, the Stripe CLI, the Stripe SDKs, and other tools developers use to write code for Stripe. Before that I worked on Azure and VS Code at Microsoft as a PM and before that I was JavaScript (both frontend and Node.js) developer for a decade at companies like LinkedIn, Netflix, Reddit, and some other startups. I&#39;ve written <em>a lot</em> of code and written a lot of queries.</p>\n<p>I learned to code when I was somewhere around 10 years old. My brother used to make me write C++ before he&#39;d let me play video games. This definitely set me up for success when I started to learn to code in college but let me tell you: it is not too late for anyone to code. The skills here are very learnable for anyone with enough gumption to get going. I started writing database queries against MySQL at my internship.</p>\n<p>When I&#39;m not working or developing new Frontend Masters courses, you&#39;ll find me in Seattle, WA. I love to travel, hang out with my wife and son, get out of breath on my Peloton, play Dota 2 and Overwatch poorly, as well as drink Islay Scotches, local IPAs and fruity coffees.</p>\n<p><img src=\"./images/social-share-cover.jpg\" alt=\"Brian teaching\"></p>\n<p>Catch up with me on social media! I&#39;ll be honest: I&#39;m not great at responding at DMs. The best way to talk to me is just to tweet at me.</p>\n<ul>\n<li><a href=\"https://twitter.com/holtbt\">Twitter</a></li>\n<li><a href=\"https://www.linkedin.com/in/btholt/\">LinkedIn</a></li>\n<li><a href=\"https://github.com/btholt\">GitHub</a></li>\n<li><a href=\"https://members.onepeloton.com/members/btholt/overview\">Peloton</a> (you have to be a member and signed in for this link to work)</li>\n</ul>\n<p>And one last request! <a href=\"https://github.com/btholt/complete-intro-to-sql\">Please star this repo</a>. It helps the course be more discoverable and with my fragile ego.</p>\n","slug":"intro","title":"Introduction","section":"Welcome","icon":"info-circle","filePath":"/home/runner/work/complete-intro-to-sql/complete-intro-to-sql/lessons/01-welcome/A-intro.md","nextSlug":"/lessons/welcome/docker","prevSlug":null}},"__N_SSG":true}